jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
                    // Set pin low when triggering is stopped
                    nrf_gpio_pin_clear(TIMESYNC_PIN);

                    NRF_LOG_INFO("Triggering stopped");
                }
            }
            break;
        default:
            APP_ERROR_CHECK_BOOL(false);
            break;
    }
}

static void sync_timer_init(void)
{
    ret_code_t err_code;

    // Debug pin:
    // nRF52-DK (PCA10040) Toggle P0.24 from sync timer to allow pin measurement
    // nRF52840-DK (PCA10056) Toggle P1.14 from sync timer to allow pin measurement
#if defined(BOARD_PCA10040)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(0, 24), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#elif defined(BOARD_PCA10056)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(1, 14), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#else
#warning Debug pin not set
#endif

    ts_init_t init_ts =
    {
        .high_freq_timer[0] = NRF_TIMER3,
        .high_freq_timer[1] = NRF_TIMER4,
        .egu                = NRF_EGU3,
        .egu_irq_type       = SWI3_EGU3_IRQn,
        .evt_handler        = ts_evt_callback,
    };

    err_code = ts_init(&init_ts);
    APP_ERROR_CHECK(err_code);

	ts_rf_config_t rf_config =
	{
		.rf_chn = 80,
		.rf_addr = { 0xDE, 0xAD, 0xBE, 0xEF, 0x19 }
	};

    err_code = ts_enable(&rf_config);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Started listening for beacons.\r\n");
    NRF_LOG_INFO("Press Button 1 to start transmitting sync beacons\r\n");
    NRF_LOG_INFO("GPIO toggling will begin when transmission has started.\r\n");
}




/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;
    switch (event)
    {
        case BSP_EVENT_KEY_0:
            NRF_LOG_INFO("Key pressed");
            imu_set_config();

            break;

        case BSP_EVENT_KEY_2:
        {
            // Print syncrhonized timestamp
            ts_print_sync_time();
            break;
        }
						
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}




// Variable to keep track if the NUS buffer is full
static bool nus_buffer_full = false;


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    ret_code_t err_code;
	
    switch (p_evt->type)
    {
        case BLE_NUS_EVT_RX_DATA:				
                // Pass change IMU settings to event handler - no RX functionality needed in slave
                // err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
                // APP_ERROR_CHECK(err_code);
            break;
                
            // Added //
            // When BLE NUS
        case BLE_NUS_EVT_TX_RDY:
                nus_buffer_full = false;
//				NRF_LOG_INFO("BLE_NUS_EVT_TX_RDY");
            break;
        case BLE_NUS_EVT_COMM_STARTED:
                NRF_LOG_DEBUG("BLE_NUS_EVT_COMM_STARTED");
            break;
        case BLE_NUS_EVT_COMM_STOPPED:
                NRF_LOG_DEBUG("BLE_NUS_EVT_COMM_STOPPED");
            break;

        default:
            break;
    }
}

void usr_ble_nus_init()
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);    
}



// CUSTOM
uint32_t nus_printf_custom(char* p_char)
{
		static uint16_t index;
		ret_code_t err_code;
		static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
		while(*p_char != '\0'){
						data_array[index] = *p_char;
						index++;
						p_char++;
						}

		err_code = ble_nus_data_send(&m_nus, data_array, &index, m_conn_handle);
		
		// Check for errors
		if ((err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != NRF_ERROR_RESOURCES) &&
				(err_code != NRF_ERROR_NOT_FOUND))
		{
				APP_ERROR_CHECK(err_code);
		}
				
		index = 0;
		return err_code;
}

// CUSTOM
uint32_t nus_printf_custom_1(char* p_char)
{
	static uint16_t index;
	ret_code_t err_code;
	static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
	while(*p_char != '\0'){
          data_array[index] = *p_char;
          index++;
          p_char++;
          }			
			do
			{
					err_code = ble_nus_data_send(&m_nus, data_array, &index, m_conn_handle);
					if ((err_code != NRF_ERROR_INVALID_STATE) &&
							(err_code != NRF_ERROR_RESOURCES) &&
							(err_code != NRF_ERROR_NOT_FOUND))
					{
							APP_ERROR_CHECK(err_code);
					}
			} while (err_code == NRF_SUCCESS);
		index = 0;
	return err_code;
}

// Send data over NUS service
uint32_t nus_send(uint8_t * data, uint16_t len)
{
		ret_code_t err_code;
	
		err_code = ble_nus_data_send(&m_nus, data, &len, m_conn_handle);
		
		// Check for errors
		if ((err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != NRF_ERROR_RESOURCES) &&
				(err_code != NRF_ERROR_NOT_FOUND))
		{
				APP_ERROR_CHECK(err_code);
		}
		return err_code;
}



